<?php

use App\Models\FoodStore;
use App\Models\Friend;
use App\Models\Residence;
use App\Models\Tour;

return [
    'residence_types' => [
        1 => 'ویلا',
        2 => 'آپارتمان',
        3 => 'سوئیت',
        4 => 'کلبه',
    ],
    'area_types' => [
        1 => 'جنگلی',
        2 => 'ساحلی',
        3 => 'شهری',
        4 => 'کوهستانی',
        5 => 'کویری',
        6 => 'روستایی',
    ],
    'tour_types' => [
        1 => 'کویرگردی',
        2 => 'آفرودی',
        3 => 'شهرگردی',
        4 => 'کوهنوردی',
        5 => 'طبیعت گردی',
        6 => 'مزه گردی',
        7 => 'روستایی',
        8 => 'تاریخی',
    ],
    'tour_residence_types' => [
        1 => 'کمپ',
        2 => 'اقامت محلی',
        3 => 'مهمان سرا',
        4 => 'هتل 1 ستاره',
        5 => 'هتل 2 ستاره',
        6 => 'هتل 3 ستاره',
        7 => 'هتل 4 ستاره',
        8 => 'بدون اقامت',
    ],
    'food_store_types' => [
        1 => 'کافه',
        2 => 'رستوران',
        3 => 'فست فود',
        4 => 'کافی شاپ',
    ],
    'food_types' => [
        1 => 'ایرانی',
        2 => 'آمریکایی',
        3 => 'ایتالیایی',
        4 => 'آسیایی',
        5 => 'دریایی',
    ],
    'travel_types' => [
        1 => 'تفریحی',
        2 => 'کاری',
    ],
    'machine_types' => [
        1 => 'هوایی',
        2 => 'زمینی',
        3 => 'دریایی',
    ],
    'genders' => [
        1 => 'آقا',
        2 => 'خانم',
        3 => 'زوج',
    ],
    'service_types' => [
        'residence' => 'اقامتگاه',
        'tour' => 'تور',
        'foodstore' => 'رستوران',
        'friend' => 'همسفر',
    ],
    'bookable_types' => [
        Residence::class => 'اقامتگاه',
        Tour::class => 'تور',
        FoodStore::class => 'رستوران',
        Friend::class => 'همسفر',
    ],
    'option_types' => [
        'residence' => 'اقامتگاه',
        'foodstore' => 'رستوران',
        'friend' => 'همسفر',
    ],
    'banner_positions' => [
        'home_hero' => 'اسلایدر اصلی',
        'home_middle' => 'میانه صفحه اصلی',
        'sidebar' => 'ستون کناری',
        'mobile' => 'موبایل',
    ],
];
